Revit 2026 API

# WireConduitTypeSetIterator Constructor

---

For Internal Use Only.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public WireConduitTypeSetIterator()
```
```vb
Public Sub New
```
```cpp
public:
WireConduitTypeSetIterator()
```
```fsharp
new : unit -> WireConduitTypeSetIterator
```

This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.

#### Reference

WireConduitTypeSetIterator Class

Autodesk.Revit.DB.Electrical Namespace